{"text":"Dear Sir, Greetings & hope you’re doing well !! This has reference to the above-cited subject, regarding the requirement of GAS AEROSOL GENERATOR,FIRE EXTINGUISHER,AEROSOL GAS RELEASE FIRE PANE AND FIRE DETECTION SYSTEM for our project. Kindly find the enclosed technical specification for your reference. We request you to kindly provide your best quotation along with the following documents. MAKE IN INDIA DECLRATION – MII Datasheet of the offered product Make \/ Model : HSN Code : ·Warranty confirmation : ·All relevant certificates such as Equipment Type Approval, EC, BIS, and other relevant certificates if applicable. We appreciate your prompt attention to this matter and your assistance. Should you require any further clarification kindly suggest.","category":"general_enquiry"}
{"text":"Dear Vendor, We at Reliance are in the process of compiling and updating our database of vendor profiles for our records & future procurement opportunities. We kindly request you to share your latest company profile.","category":"general_enquiry"}
{"text":"Hello sir, My Name is Navi and I am from California USA. I am running my own buisness in India and And I Have best Clint list over there. Now recently I shifted to USA from last 3 year. We plan to work here also with same profession to sell fire fighting equipment. I looking for one of the best brand and manufacturer's which one full fill our requirements in USA and India also after search on internet I see your brand is suitable for me . Hope your brand and company support me to sell best quality to the customers satisfaction. First we start with extinguisher sale of your brand so plz send me your price list and your brand catalog for me . give me best price so that we can beat other brands in Markit. ABC 2lb to 10 lb ABC 4 kg. 6 kg. 10kg Note: I have 13\/14 year experience in fire and industrial safety and also member of NFPA And FSAI ( INDIA)was worked with world leadings brands. We are waiting for your reply.","category":"general_enquiry"}
{"text":"Hi Team, Good Day. I wanted to check with you if your Fire Fite brand fire extinguishers have type approval certificates. I am specifically looking for ABC (Stored Pressure) Type Fire Extinguisher 02 Kg. Capacity. As per IS : 15683.","category":"general_enquiry"}
{"text":"Dear, My name is Quynh Anh Nguyen, Purchasing Manager of HAANH Group. We are currently sourcing aerosol fire extinguishing units (2.5kg–5kg) for an upcoming defense project in Vietnam. Our company has over 20 years of experience delivering major national projects in partnership with key government agencies such as the Ministry of National Defense and the Ministry of Public Security. We are seeking reliable, certified products for use in high-risk environments such as server rooms, electrical panels, and control cabinets. For this project, it is mandatory that the units are UL 2775 certified or FM approved. We kindly request the following information: Product catalogue and technical datasheet Copy of UL or FM certificate (scanned) Best quotation for bulk quantity Estimated lead time and delivery schedule Warranty and after-sales service details We look forward to your prompt response and the opportunity to collaborate with your company.","category":"general_enquiry"}
{"text":"Dear Team, Greetings from Tiger Fire! We, Tiger Fire and Security System, based in Abu Dhabi, UAE, are writing to express our interest in representing your esteemed brand as an agent\/distributor for your firefighting products—particularly the Kitchen Hood Suppression System—in the United Arab Emirates. With over 5 years of experience in the fire safety industry and a well-established network of clients across industrial, commercial, and government sectors, we are confident in our ability to promote and expand your product presence in this growing market. We are highly impressed by the quality and innovation of your product range, which aligns perfectly with our company’s values and the market demands in our region. We would appreciate the opportunity to explore a potential collaboration and request more information regarding your agency terms, product catalog, and partnership requirements. Please let us know a convenient time for a call or virtual meeting. Thank you for considering our request. We look forward to the possibility of working together.","category":"general_enquiry"}
{"text":"Dear Sir, We have a requirement of \"SCBA SET - 04 NOS & SPARES SCBA CYLINDERS - 04 NOS\" as per the attached specifications sheet. END USER: GRSE - KOLKATA We request you to kindly forward the techno commercial proposal along with catalogues. We are looking for your kind support and cooperation.","category":"general_enquiry"}
{"text":"Dear Madam Please find our BIS Licence copy and IRS certificate for SBC. Thanks & Regards,","category":"general_enquiry"}
{"text":"Dear Sir\/Madam, Please find attached Enquiry for EE systems Please Quote me the offer in the BOQ (excel file) Provided only in front of the line item. Kindly give us the best rates for the same at the EOD. Also quote for QRO line item. Waiting for your favourable response. Kindly take this on priority. Project – Eviden -pune","category":"general_enquiry"}
{"text":"Dear Team, We have an urgent requirement of CO2 Fire Extinguishers & Firefighting Foam for PKG 01 & PKG 02 as per attached specification. Request you to please go through the same and submit your offer with complete terms & conditions. Technical Acceptance cum Deviation Sheet duly filled, signed and stamped shall be required along with offer. Also please submit the Catalogue or Datasheet of the items you intend to quote. The following points needs to be considered while submitting the offer :- Incoterm : DDP MPT Central Warehouse & Bhagyam Warehouse (Vedanta-Barmer – Rajasthan) as per Qty specified in attached sheet. Packing & Forwarding, Freight, Transit Insurance shall be in your scope. It shall be included in your quoted price. No extra charges shall be payable. GST Rate & HSN Code should be mentioned clearly. Payment Terms : Within 30 days from receipt & acceptance of material at site. Offer Validity shall be 90 days minimum. Lead time to be confirmed. Warranty Period to be confirmed Material Test Certificates\/Warranty Certificates shall be required along with material. Please note that this is our firm requirement, so your complete offer (duly signed & stamped) should be submitted within 3 working days from receipt of this mail.","category":"general_enquiry"}
{"text":"Dear, Project:- Netmagic DC8 NAV 2-Fire Extinguishers Location-Mumbai Please send the following documents with your quote :- Data sheet, Make & Model num against quoted BOQ line item. HSN code & GST Applicable. Applicable Standard warranty for 3 years Freight till site (Included & Delivery timeline. Rate Validity Any Deviation from the BOQ & Technical Specs (attached) to be highlighted (if not done, will be considered as fully complied) Looking forward to your techno commercial proposal ASAP. Please acknowledge the receipt of this email. Thank you","category":"general_enquiry"}
{"text":"Dear Business partner, We require Eye washer for shop floor. Please refer below specification and submit quotation as soon as possible. Eye\/Face wash fountain: Eye wash fountain head is between 830-1140 mm (83 cm-114 cm) above floor surface. Eyewash Head: Two high-flow sprays, operated at low pressure, which washes the eye and face. Anti-dust cover protects the head from airborne contaminants and automatically opens with water pressure. Distance between two eye wash head is 140 to 200 mm as per standard. Eyewash Bowl: Bowl Material: SS 304 Size of ABS Bowl 260 ± 5 mm. Material: Pipe: SS304 Fitting: SS304 Flange: SS Casting 304 grade Foot Pedal: For easy supply and control of water flow in the eye wash head without use of hand. Features: Water inlet connections of 1\/2’’ NB for eye\/face wash. Water outlet connection – 1¼” NB Eye wash discharge rate – 12 lpm.(minimum) . Manually operated valve with push plate for hazel-free usage. Receptor bowl attached for minimize wastage of water. With foot pedal for hands-free operation to supply and control water flow through eye wash heads. Water supply Operating Pressure: 2.1 Kg \/ cm2 (30 PSI). Foot Pedal: For easy supply and control of water flow in the eye wash head without use of hand. Base Plate: To hold the shower structure in a stable position. Diameter of the base plate shall be 180 ± 3 m. Push to Open Valve: ½” BSP Ball valve connects units to uninterruptible water supply as per requirement. Colure: Powder-coated Quantity: 5","category":"general_enquiry"}
